/*
'******************************************************************************
' 파일명    : dp1.cpp
' 작성자    : 차경민
' 목적      : Problem Solving
' 날짜      : 2020/07/14
' 문제      : 네트워크 선 자르기 (Bottom up)
'
' 문제 설명 : ...
'            
' 출력 설명 : ...
' 
'예제   7
'      => 21
'******************************************************************************
*/
#include <iostream>
using namespace std;
int dp[50];
int main(){
    int n, i;
    cin >> n;
    dp[0] = 1;
    dp[1] = 1;
    for(i=2;i<=n;i++){
        dp[i] = dp[i-1] + dp[i-2];
    }
    cout << dp[n] << endl;
    return 0;
}