/*
'******************************************************************************
' 파일명    : pps31.cpp
' 작성자    : 차경민
' 목적      : Problem Solving
' 날짜      : 2020/07/17
' 문제      : 탄화 수소 질량
'
' 문제 설명 : 탄소(C)와 수소(H)로만 이루어진 화합물을 탄화수소라고 합니다.
'탄소(C) 한 개의 질량은 12g, 수소(H) 한 개의 질량은 1g입니다. 에틸렌(C2H4)의 질량은 12*2+1*4=28g입니다.
'메탄(CH4)의 질량은 12*1+1*4=16g입니다.
'탄화수소식이 주어지면 해당 화합물의 질량을 구하는 프로그램을 작성하세요.
'            
' 출력 설명 : 첫 줄에 탄화수소의 질량을 출력
' 
'예제   C2H4      CH4
'    => 28      =>16
'******************************************************************************
*/
#include <iostream>
#include <string>
using namespace std;
int main(){
    freopen("input.txt", "rt", stdin);
    int i, sum=0;
    string str;
    
    return 0;
}